src/cf/Catalogs/ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента</Name>
			<Comment>Настройки выгрузки/загрузки данных, имя объекта сохранено в связи с динамическим созданием прав и правил префиксации</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантИспользованияНастройки</Name>
					<Comment>Определяет предназначение настройки: загрузка или выгрузка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ор_ВариантыИспользованияНастройки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрикладногоОбъекта</Name>
					<Comment>Справочник, Документ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ор_ТипыПрикладныхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПрикладногоОбъекта</Name>
					<Comment>Имя документа, как оно указанно в метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Comment>Имя табличной части, как оно указанно в метаданных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПрикладногоОбъекта</Name>
					<Comment>Представление документа, справочника, для отображения пользователю</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТабличнойЧасти</Name>
					<Comment>Имя табличной части, для отображения пользователю</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЗагрузкиВыгрузки</Name>
					<Comment>Настройки загрузки</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретСозданияНовыхЭлементов</Name>
					<Comment>Флаг Не создавать новых элементов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
					<Comment>Контрагенты</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Настройка доступна для указанных контрагентов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ор_ТипыПрикладныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ор_ТипыПрикладныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ор_НастройкиЗагрузкиДанныхИзТабличногоДокумента/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура обновляет представления документа и табличной части
// из метаданных
//
// Параметры:
//  Нет
//
Процедура ОбновитьПредставления() Экспорт
	
	// Попробуем заполнить представление по метаданным.
	ОбъектМетаданных = ПолучитьМетаданныеИсточника();
	Если ОбъектМетаданных=Неопределено Тогда
		ПредставлениеПрикладногоОбъекта = ИмяПрикладногоОбъекта;
		ПредставлениеТабличнойЧасти = ИмяТабличнойЧасти;
		Возврат;
	КонецЕсли;
	
	Если ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
		ПредставлениеПрикладногоОбъекта = ОбъектМетаданных.Представление();
		ПредставлениеТабличнойЧасти = "";
	ИначеЕсли ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
		ПредставлениеПрикладногоОбъекта = ОбъектМетаданных.Родитель().Представление();
		ПредставлениеТабличнойЧасти = ОбъектМетаданных.Представление();
	КонецЕсли; 

КонецПроцедуры // ОбновитьПредставления()

// Процедура формирует наименование объекта
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//    Строка - Наименование
//
Функция СформироватьНаименование() Экспорт
	
	// Формируем наименование в зависимости от заполненных реквизитов.
	Стр = "";
	Если ПустаяСтрока(ПредставлениеПрикладногоОбъекта)  Тогда
		Возврат Стр;
	КонецЕсли;
	
	Стр = Стр+ПредставлениеПрикладногоОбъекта;
	
	Если НЕ ПустаяСтрока(ПредставлениеТабличнойЧасти)  Тогда
		Возврат Стр+" ("+ПредставлениеТабличнойЧасти+")";
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции // СформироватьНаименование()

// Процедура заполняет настройки в структуру на основании табличного документа (выгрузка)
//
// Параметры:
//  Настройки - ТабличныйДокумент - Табличный документ
//
// Возвращаемое значение:
//  Структура - Неопределено - Структура полученных настроек, неопределено в случае ошибки
//
Функция ПолучитьНастройкиВыгрузкиИзТабличногоДокумента(Настройки) Экспорт
	
	Если ТипЗнч(Настройки)<>Тип("ТабличныйДокумент") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Исходные данные табличной части (КЕШ).
	мВыгружаемыеРеквизиты = Новый ТаблицаЗначений;
	мВыгружаемыеРеквизиты.Колонки.Добавить("ТипПоля");
	мВыгружаемыеРеквизиты.Колонки.Добавить("Представление");
	мВыгружаемыеРеквизиты.Колонки.Добавить("ПолеДБФ");
	мВыгружаемыеРеквизиты.Колонки.Добавить("Тип");
	мВыгружаемыеРеквизиты.Колонки.Добавить("Длина");
	мВыгружаемыеРеквизиты.Колонки.Добавить("Точность");
	мВыгружаемыеРеквизиты.Колонки.Добавить("Данные");
	
	Попытка
		Версия = СокрЛП(Настройки.Область("R1C5").Текст);
		Если Версия = "1.0" Тогда
			мТипОбъекта = СокрЛП(Настройки.Область("R2C5").Текст);
			Если (((мТипОбъекта<>"табличная часть документа") И (мТипОбъекта<>"табличная часть обработки")) И (мТипОбъекта<>"справочник")) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Значение поля ""Тип объекта"" не корректно'"));
				Возврат Неопределено;
			КонецЕсли;
			
			Если мТипОбъекта="табличная часть документа" Тогда
				мТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ;
			ИначеЕсли мТипОбъекта="табличная часть обработки" Тогда
				мТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка;
			Иначе
				мТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник;
			КонецЕсли;
			
			мМетаданныеИсточника = Метаданные.НайтиПоПолномуИмени(Настройки.Область("R3C5").Текст);
			Если мМетаданныеИсточника = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Ошибка определения метаданных'"));
				Возврат Неопределено;
			КонецЕсли;
			мФорматФайла = СокрЛП(Настройки.Область("R4C5").Текст);
			мКодировка   = СокрЛП(Настройки.Область("R5C5").Текст);
			мПередВыгрузкойОбъекта =  СокрЛП(Настройки.Область("R6C5").Текст);
			мПослеДобавленияСтроки =  СокрЛП(Настройки.Область("R7C5").Текст);
			
			ТекущаяСтрока = 10;
			ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
			ПризнакСтроки = Настройки.Область(ТекущаяСтрокаОбласти+ "C1").Текст;
			
			Пока ПризнакСтроки = "Х" Цикл
				Попытка Длина    = Число(Настройки.Область(ТекущаяСтрокаОбласти + "C6").Текст); Исключение Длина = 0;    КонецПопытки;
				Попытка Точность = Число(Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст); Исключение Точность = 0; КонецПопытки;
				
				СтрокаИсходныхДанных = мВыгружаемыеРеквизиты.Добавить();
				
				СтрокаИсходныхДанных.ТипПоля       = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
				СтрокаИсходныхДанных.Представление = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
				СтрокаИсходныхДанных.ПолеДБФ       = Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст;
				СтрокаИсходныхДанных.Тип           = Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст;
				СтрокаИсходныхДанных.Длина         = Длина;
				СтрокаИсходныхДанных.Точность      = Точность;
				СтрокаИсходныхДанных.Данные        = Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст;
				
				ТекущаяСтрока = ТекущаяСтрока + 1;
				ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
				ПризнакСтроки = Настройки.Область(ТекущаяСтрокаОбласти+ "C1").Текст;
			КонецЦикла;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'Файл не содержит настройки выгрузки данных'"));
			Возврат Неопределено;
		КонецЕсли;
	Исключение
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru= '%1'"), ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ТипПрикладногоОбъекта",мТипПрикладногоОбъекта);
	СтруктураНастроек.Вставить("МетаданныеИсточника",мМетаданныеИсточника);
	СтруктураНастроек.Вставить("ФорматФайла",мФорматФайла);
	СтруктураНастроек.Вставить("Кодировка",мКодировка);
	СтруктураНастроек.Вставить("ПередВыгрузкойОбъекта",мПередВыгрузкойОбъекта);
	СтруктураНастроек.Вставить("ПослеДобавленияСтроки",мПослеДобавленияСтроки);
	СтруктураНастроек.Вставить("ВыгружаемыеРеквизиты",мВыгружаемыеРеквизиты);
	
	Возврат СтруктураНастроек;
	
КонецФункции // ПолучитьНастройкиВыгрузкиИзТабличногоДокумента()

// Функция определить возможность установки режима поиска для текущих данных
//
Функция ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных(РеквизитПоиска, ОписаниеТиповРеквизита, РеквизитИскатьПо, РеквизитЗначениеПоУмолчанию) Экспорт	
	
	// Режим поиска по похожим словам.
	Если РеквизитПоиска="Владелец"
		ИЛИ РеквизитПоиска="Родитель" Тогда
		
		Возврат Ложь;
		
	ИначеЕсли РеквизитПоиска="Наименование" Тогда
		
		Возврат Истина;
		
	Иначе
		Если НЕ ОписаниеТиповРеквизита.СодержитТип(Тип("Строка")) Тогда
			МассивТипов = ОписаниеТиповРеквизита.Типы();
			Если МассивТипов.Количество()<>0 Тогда
				ТипРеквизита = МассивТипов[0];
				Попытка
					Если ТипЗнч(РеквизитЗначениеПоУмолчанию[РеквизитИскатьПо]) = Тип("Строка") Тогда
						Возврат Истина;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции //ОпределитьВозможностьУстановкиРежимаПоискаДляТекущихДанных()

// Функция возвращает метаданные источника данных
//
// Параметры:
//  ЗаполнитьПредставления - Булево
//
// Возвращаемое значение:
//   ОбъектМетаданныхТабличнаяЧасть	- Объект метаданных
//
Функция ПолучитьМетаданныеИсточника(ЗаполнитьПредставления = Ложь) Экспорт
	Если ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Справочник Тогда
		ОбъектМетаданныхСправочник = Метаданные.Справочники.Найти(ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхСправочник<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхСправочник.Представление();
			КонецЕсли;
			Возврат ОбъектМетаданныхСправочник;
		КонецЕсли;
		
	ИначеЕсли ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Документ Тогда
		ОбъектМетаданныхДокумент = Метаданные.Документы.Найти(ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхДокумент<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхДокумент.Представление();
			КонецЕсли;
			ОбъектМетаданныхТабличнаяЧасть = ОбъектМетаданныхДокумент.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
			Если ОбъектМетаданныхТабличнаяЧасть<>Неопределено Тогда
				Если ЗаполнитьПредставления Тогда
					ПредставлениеТабличнойЧасти = ОбъектМетаданныхТабличнаяЧасть.Представление();
				КонецЕсли;
				Возврат ОбъектМетаданныхТабличнаяЧасть;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.Обработка Тогда
		ОбъектМетаданныхОбработка = Метаданные.Обработки.Найти(ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхОбработка<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхОбработка.Представление();
			КонецЕсли;
			Возврат ОбъектМетаданныхОбработка;
		КонецЕсли;
		
	ИначеЕсли ТипПрикладногоОбъекта = Перечисления.ор_ТипыПрикладныхОбъектов.РегистрСведений Тогда
		ОбъектМетаданныхРегистр = Метаданные.РегистрыСведений.Найти(ИмяПрикладногоОбъекта);
		Если ОбъектМетаданныхРегистр<>Неопределено Тогда
			Если ЗаполнитьПредставления Тогда
				ПредставлениеПрикладногоОбъекта = ОбъектМетаданныхРегистр.Представление();
			КонецЕсли;
			Возврат ОбъектМетаданныхРегистр;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции // ПолучитьМетаданныеИсточника()

#КонецОбласти

#Область ОбработчикиСобытий

// Стандартный обработчик ПередЗаписью элемента справочника
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

#КонецОбласти

#КонецЕсли
